; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 77)
	(= (value c1) 95)
	(= (value c2) 80)
	(= (value c3) 29)
	(= (value c4) 69)
	(= (value c5) 11)
	(= (value c6) 52)
	(= (value c7) 15)
	(= (value c8) 73)
	(= (value c9) 74)
	(= (value c10) 83)
	(= (value c11) 2)
	(= (value c12) 61)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 7 of 12
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 7 of 12
3. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 12
4. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 12
5. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 12
6. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 7 of 12
7. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 12
8. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 12
9. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 12
10. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 12
11. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 12
12. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 12
13. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 7 of 12
14. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 12
15. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 12
16. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 7 of 12
17. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 7 of 12
18. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 7 of 12
19. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 7 of 12
20. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 12
21. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 12
22. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 12
23. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 12
24. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 7 of 12
25. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 7 of 12
26. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 12
27. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 7 of 12
28. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 12
29. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 12
30. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 7 of 12
31. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 7 of 12
32. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 7 of 12
33. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 7 of 12
34. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 7 of 12
35. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 7 of 12
36. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 7 of 12
37. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 7 of 12
38. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 7 of 12
39. (increment c11)
   changed: (value c11) from 2 to 11
   goals met: 7 of 12
40. (increment c11)
   changed: (value c11) from 11 to 20
   goals met: 7 of 12
41. (increment c11)
   changed: (value c11) from 20 to 29
   goals met: 7 of 12
42. (increment c11)
   changed: (value c11) from 29 to 38
   goals met: 7 of 12
43. (increment c11)
   changed: (value c11) from 38 to 47
   goals met: 7 of 12
44. (increment c11)
   changed: (value c11) from 47 to 56
   goals met: 7 of 12
45. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 7 of 12
46. (increment c11)
   changed: (value c11) from 56 to 66
   goals met: 6 of 12
47. (decrement c10)
   changed: (value c10) from 83 to 78
   goals met: 6 of 12
48. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 6 of 12
49. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 6 of 12
50. (increment c7)
   changed: (value c7) from 15 to 23
   goals met: 6 of 12
51. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 12
52. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 6 of 12
53. (increment c7)
   changed: (value c7) from 23 to 31
   goals met: 6 of 12
54. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 6 of 12
55. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 6 of 12
56. (increment c7)
   changed: (value c7) from 31 to 41
   goals met: 6 of 12
57. (increment c7)
   changed: (value c7) from 41 to 51
   goals met: 6 of 12
58. (increment c7)
   changed: (value c7) from 51 to 61
   goals met: 7 of 12
59. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 7 of 12
60. (increment c5)
   changed: (value c5) from 11 to 20
   goals met: 7 of 12
61. (increment c5)
   changed: (value c5) from 20 to 29
   goals met: 7 of 12
62. (increment c5)
   changed: (value c5) from 29 to 38
   goals met: 7 of 12
63. (increment c5)
   changed: (value c5) from 38 to 47
   goals met: 7 of 12
64. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 7 of 12
65. (increment c5)
   changed: (value c5) from 47 to 57
   goals met: 6 of 12
66. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 6 of 12
67. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 6 of 12
68. (increment c3)
   changed: (value c3) from 29 to 37
   goals met: 6 of 12
69. (increment c3)
   changed: (value c3) from 37 to 45
   goals met: 6 of 12
70. (increment c3)
   changed: (value c3) from 45 to 53
   goals met: 6 of 12
71. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 6 of 12
72. (increment c3)
   changed: (value c3) from 53 to 62
   goals met: 6 of 12
73. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 6 of 12
74. (increment c3)
   changed: (value c3) from 62 to 72
   goals met: 5 of 12
75. (increment c3)
   changed: (value c3) from 72 to 82
   goals met: 6 of 12
76. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 6 of 12
77. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 6 of 12
78. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 6 of 12
79. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 6 of 12
80. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 6 of 12
81. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 6 of 12
82. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 6 of 12
83. (increment c2)
   changed: (value c2) from 80 to 85
   goals met: 5 of 12
84. (increment c2)
   changed: (value c2) from 85 to 90
   goals met: 5 of 12
85. (increment c2)
   changed: (value c2) from 90 to 95
   goals met: 5 of 12
86. (decrement c1)
   changed: (value c1) from 95 to 93
   goals met: 6 of 12
87. (increment c6)
   changed: (value c6) from 52 to 54
   goals met: 6 of 12
88. (increment c6)
   changed: (value c6) from 54 to 56
   goals met: 6 of 12
89. (increment c6)
   changed: (value c6) from 56 to 58
   goals met: 7 of 12
90. (increment c11)
   changed: (value c11) from 66 to 76
   goals met: 7 of 12
91. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 12
92. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 7 of 12
93. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 7 of 12
94. (increment c12)
   changed: (value c12) from 61 to 64
   goals met: 7 of 12
95. (increment c12)
   changed: (value c12) from 64 to 67
   goals met: 7 of 12
96. (increment c12)
   changed: (value c12) from 67 to 70
   goals met: 7 of 12
97. (increment c12)
   changed: (value c12) from 70 to 73
   goals met: 7 of 12
98. (increment c12)
   changed: (value c12) from 73 to 76
   goals met: 7 of 12
99. (increment c12)
   changed: (value c12) from 76 to 79
   goals met: 8 of 12
100. (increment c11)
   changed: (value c11) from 76 to 86
   goals met: 8 of 12
101. (increment c12)
   changed: (value c12) from 79 to 82
   goals met: 8 of 12
102. (increment c12)
   changed: (value c12) from 82 to 85
   goals met: 8 of 12
103. (increment c12)
   changed: (value c12) from 85 to 88
   goals met: 9 of 12
104. (increment c3)
   changed: (value c3) from 82 to 92
   goals met: 9 of 12
105. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 9 of 12
106. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 9 of 12
107. (increment c4)
   changed: (value c4) from 69 to 75
   goals met: 9 of 12
108. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 9 of 12
109. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 9 of 12
110. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 9 of 12
111. (decrement c2)
   changed: (value c2) from 95 to 90
   goals met: 9 of 12
112. (decrement c1)
   changed: (value c1) from 93 to 91
   goals met: 9 of 12
113. (decrement c1)
   changed: (value c1) from 91 to 89
   goals met: 10 of 12
114. (increment c5)
   changed: (value c5) from 57 to 67
   goals met: 9 of 12
115. (increment c5)
   changed: (value c5) from 67 to 77
   goals met: 10 of 12
116. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 10 of 12
117. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 10 of 12
118. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 10 of 12
119. (increment c6)
   changed: (value c6) from 58 to 63
   goals met: 9 of 12
120. (increment c7)
   changed: (value c7) from 61 to 71
   goals met: 10 of 12
121. (increment c6)
   changed: (value c6) from 63 to 68
   goals met: 10 of 12
122. (increment c6)
   changed: (value c6) from 68 to 73
   goals met: 9 of 12
123. (increment c7)
   changed: (value c7) from 71 to 81
   goals met: 9 of 12
124. (increment c6)
   changed: (value c6) from 73 to 78
   goals met: 10 of 12
125. (increment c4)
   changed: (value c4) from 75 to 84
   goals met: 9 of 12
126. (decrement c7)
   changed: (value c7) from 81 to 71
   goals met: 9 of 12
127. (decrement c6)
   changed: (value c6) from 78 to 73
   goals met: 8 of 12
128. (decrement c6)
   changed: (value c6) from 73 to 68
   goals met: 9 of 12
129. (decrement c5)
   changed: (value c5) from 77 to 67
   goals met: 10 of 12
130. (decrement c3)
   changed: (value c3) from 92 to 82
   goals met: 10 of 12
131. (decrement c2)
   changed: (value c2) from 90 to 85
   goals met: 9 of 12
132. (decrement c2)
   changed: (value c2) from 85 to 80
   goals met: 10 of 12
133. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 10 of 12
134. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 10 of 12
135. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 10 of 12
136. (decrement c1)
   changed: (value c1) from 89 to 84
   goals met: 10 of 12
137. (decrement c1)
   changed: (value c1) from 84 to 79
   goals met: 11 of 12
138. (increment c5)
   changed: (value c5) from 67 to 77
   goals met: 10 of 12
139. (increment c6)
   changed: (value c6) from 68 to 73
   goals met: 9 of 12
140. (increment c7)
   changed: (value c7) from 71 to 81
   goals met: 9 of 12
141. (increment c6)
   changed: (value c6) from 73 to 78
   goals met: 10 of 12
142. (decrement c4)
   changed: (value c4) from 84 to 75
   goals met: 10 of 12
143. (decrement c3)
   changed: (value c3) from 82 to 72
   goals met: 10 of 12
144. (decrement c2)
   changed: (value c2) from 80 to 75
   goals met: 9 of 12
145. (decrement c2)
   changed: (value c2) from 75 to 70
   goals met: 10 of 12
146. (decrement c1)
   changed: (value c1) from 79 to 74
   goals met: 9 of 12
147. (decrement c1)
   changed: (value c1) from 74 to 69
   goals met: 10 of 12
148. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 10 of 12
149. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 10 of 12
150. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 10 of 12
151. (decrement c0)
   changed: (value c0) from 77 to 74
   goals met: 10 of 12
152. (decrement c0)
   changed: (value c0) from 74 to 71
   goals met: 10 of 12
153. (decrement c0)
   changed: (value c0) from 71 to 68
   goals met: 11 of 12
154. (decrement c7)
   changed: (value c7) from 81 to 71
   goals met: 11 of 12
155. (decrement c6)
   changed: (value c6) from 78 to 73
   goals met: 10 of 12
156. (decrement c6)
   changed: (value c6) from 73 to 68
   goals met: 11 of 12
157. (decrement c5)
   changed: (value c5) from 77 to 67
   goals met: 11 of 12
158. (decrement c4)
   changed: (value c4) from 75 to 66
   goals met: 11 of 12
159. (decrement c3)
   changed: (value c3) from 72 to 62
   goals met: 11 of 12
160. (decrement c2)
   changed: (value c2) from 70 to 65
   goals met: 10 of 12
161. (decrement c2)
   changed: (value c2) from 65 to 60
   goals met: 11 of 12
162. (decrement c1)
   changed: (value c1) from 69 to 64
   goals met: 10 of 12
163. (decrement c1)
   changed: (value c1) from 64 to 59
   goals met: 11 of 12
164. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 11 of 12
165. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 11 of 12
166. (decrement c0)
   changed: (value c0) from 68 to 63
   goals met: 11 of 12
167. (decrement c0)
   changed: (value c0) from 63 to 58
   goals met: 12 of 12
